[
    {
      "id": "1",
      "activeIngredientA": "SILDENAFIL",
      "activeIngredientB": "NITROGLYCERIN",
      "severity": "Severe",
      "description": "Potentially life-threatening hypotension (severely low blood pressure).",
      "mechanism": "Both are potent vasodilators. Sildenafil inhibits phosphodiesterase type 5 (PDE5), increasing the effect of nitric oxide, while Nitroglycerin is an exogenous source of nitric oxide. Combining them leads to a dangerous, synergistic drop in blood pressure.",
      "management": "Concomitant use is **absolutely contraindicated**.",
      "evidenceLevel": "High"
    },
    {
      "id": "2",
      "activeIngredientA": "WARFARIN",
      "activeIngredientB": "AMIODARONE",
      "severity": "Severe",
      "description": "Greatly increased risk of bleeding due to enhanced anticoagulant effect.",
      "mechanism": "Amiodarone inhibits CYP2C9, the primary enzyme metabolizing the more potent S-enantiomer of Warfarin, leading to significantly increased Warfarin plasma concentrations and a rise in INR (International Normalized Ratio).",
      "management": "If co-administration is necessary, the Warfarin dose should typically be **reduced by 30-50%** when Amiodarone is initiated, and INR must be monitored frequently.",
      "evidenceLevel": "High"
    },
    {
      "id": "3",
      "activeIngredientA": "ALLOPURINOL",
      "activeIngredientB": "AZATHIOPRINE",
      "severity": "Severe",
      "description": "Increased risk of severe, potentially fatal bone marrow suppression (myelosuppression), leading to low blood cell counts.",
      "mechanism": "Allopurinol inhibits xanthine oxidase, an enzyme essential for the metabolism of Azathioprine's active metabolite (6-mercaptopurine). This results in excessively high levels of the active metabolite.",
      "management": "Avoid combination. If necessary, the dose of Azathioprine (or its precursor) must be **reduced to 25%** of the usual dose, with strict monitoring of blood counts.",
      "evidenceLevel": "High"
    },
    {
      "id": "4",
      "activeIngredientA": "ATORVASTATIN",
      "activeIngredientB": "CLARITHROMYCIN",
      "severity": "Severe",
      "description": "Increased risk of myopathy and rhabdomyolysis (severe muscle breakdown).",
      "mechanism": "Clarithromycin is a potent inhibitor of CYP3A4, the primary enzyme metabolizing Atorvastatin. This dramatically increases Atorvastatin plasma concentration.",
      "management": "Avoid combination. If a macrolide is needed, use Azithromycin (minimal CYP3A4 inhibition) or temporarily interrupt Atorvastatin therapy.",
      "evidenceLevel": "High"
    },
    {
      "id": "5",
      "activeIngredientA": "LEVOTHYROXINE",
      "activeIngredientB": "CALCIUM CARBONATE",
      "severity": "Moderate",
      "description": "Reduced efficacy of Levothyroxine, potentially leading to hypothyroidism.",
      "mechanism": "Calcium carbonate, and other calcium salts, bind to Levothyroxine in the gastrointestinal tract, forming a non-absorbable complex.",
      "management": "Separate the administration of Levothyroxine and Calcium Carbonate by at least **4 hours**.",
      "evidenceLevel": "High"
    },
    {
      "id": "6",
      "activeIngredientA": "IBUPROFEN",
      "activeIngredientB": "LISINOPRIL",
      "severity": "Moderate",
      "description": "Reduced antihypertensive effect of Lisinopril and increased risk of kidney impairment (acute renal failure), especially in dehydrated or elderly patients.",
      "mechanism": "Ibuprofen (a nonsteroidal anti-inflammatory drug or NSAID) inhibits prostaglandin synthesis, which can counteract the beneficial renal effects of Lisinopril (an ACE inhibitor).",
      "management": "Monitor blood pressure and kidney function (BUN/creatinine) closely. Avoid chronic co-administration, especially in high-risk patients.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "7",
      "activeIngredientA": "ACETYLSALICYLIC ACID",
      "activeIngredientB": "IBUPROFEN",
      "severity": "Moderate",
      "description": "Reduced antiplatelet effect of low-dose Aspirin, potentially decreasing its cardiovascular protection.",
      "mechanism": "Ibuprofen can reversibly compete with Aspirin for binding to the platelet cyclooxygenase-1 (COX-1) site, preventing Aspirin's irreversible antiplatelet action.",
      "management": "If both are necessary, administer Aspirin at least **30 minutes before** or **8 hours after** Ibuprofen.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "8",
      "activeIngredientA": "AMOXICILLIN",
      "activeIngredientB": "ALLOPURINOL",
      "severity": "Moderate",
      "description": "Increased incidence of drug-related skin rash.",
      "mechanism": "The exact mechanism is unclear but may be due to immunological factors when both drugs are co-administered, especially in hyperuricemic patients.",
      "management": "Monitor for rash. While not an absolute contraindication, an alternative antibiotic may be preferred.",
      "evidenceLevel": "High"
    },
    {
      "id": "9",
      "activeIngredientA": "FLUOXETINE",
      "activeIngredientB": "TRAMADOL",
      "severity": "Moderate",
      "description": "Increased risk of **Serotonin Syndrome** and increased risk of seizures.",
      "mechanism": "Fluoxetine is a potent serotonin reuptake inhibitor (SSRI), and Tramadol acts as a weak serotonin reuptake inhibitor. Combined use leads to excessive central nervous system serotonin activity. Fluoxetine also inhibits CYP2D6, which is involved in Tramadol metabolism.",
      "management": "Avoid combination. If necessary, use lowest effective doses and monitor for symptoms of Serotonin Syndrome (agitation, hyperreflexia, fever).",
      "evidenceLevel": "High"
    },
    {
      "id": "10",
      "activeIngredientA": "ALPRAZOLAM",
      "activeIngredientB": "ALCOHOL",
      "severity": "Severe",
      "description": "Profound sedation, respiratory depression, coma, and death.",
      "mechanism": "Both are Central Nervous System (CNS) depressants. They have additive depressant effects on the CNS, severely impairing coordination, reaction time, and respiratory drive.",
      "management": "Patients should be strictly advised to **avoid alcohol** while taking Alprazolam or other benzodiazepines.",
      "evidenceLevel": "High"
    },
    {
      "id": "11",
      "activeIngredientA": "RIFAMPICIN",
      "activeIngredientB": "ETHINYL ESTRADIOL",
      "severity": "Moderate",
      "description": "Decreased effectiveness of hormonal contraceptives (Ethinyl Estradiol), leading to a risk of unintended pregnancy.",
      "mechanism": "Rifampicin is a potent inducer of hepatic CYP3A4, the enzyme responsible for metabolizing Ethinyl Estradiol, resulting in rapid clearance and subtherapeutic plasma levels.",
      "management": "Patients must use a reliable **alternative, non-hormonal method of contraception** during Rifampicin therapy and for at least 28 days after discontinuation.",
      "evidenceLevel": "High"
    },
    {
      "id": "12",
      "activeIngredientA": "AMOXICILLIN",
      "activeIngredientB": "METHOTREXATE",
      "severity": "Moderate",
      "description": "Increased risk of Methotrexate toxicity (e.g., bone marrow suppression, liver toxicity).",
      "mechanism": "Amoxicillin (a penicillin) may competitively inhibit the renal tubular secretion of Methotrexate, leading to higher and more prolonged Methotrexate plasma concentrations.",
      "management": "Monitor Methotrexate levels and signs of toxicity. Consider an alternative antibiotic if possible. Methotrexate dose may require adjustment.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "13",
      "activeIngredientA": "DICLOFENAC SODIUM",
      "activeIngredientB": "LITHIUM CARBONATE",
      "severity": "Moderate",
      "description": "Increased serum Lithium levels, leading to risk of Lithium toxicity.",
      "mechanism": "Diclofenac (an NSAID) reduces renal blood flow and can decrease the renal clearance of Lithium, leading to drug accumulation.",
      "management": "Monitor Lithium levels closely (e.g., twice weekly). Lithium dose may need to be reduced.",
      "evidenceLevel": "High"
    },
    {
      "id": "14",
      "activeIngredientA": "CITALOPRAM",
      "activeIngredientB": "METOPROLOL",
      "severity": "Moderate",
      "description": "Increased plasma concentration of Metoprolol, leading to enhanced effects (e.g., bradycardia, hypotension).",
      "mechanism": "Citalopram is a moderate inhibitor of CYP2D6, the primary enzyme metabolizing Metoprolol.",
      "management": "Monitor heart rate and blood pressure. Metoprolol dose reduction may be necessary.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "15",
      "activeIngredientA": "OXYMETAZOLINE",
      "activeIngredientB": "PROPRANOLOL",
      "severity": "Minor",
      "description": "Potential for increased blood pressure, counteracting the effect of Propranolol.",
      "mechanism": "Oxymetazoline (a nasal decongestant) is an alpha-adrenergic agonist that causes vasoconstriction, which can lead to systemic pressor effects.",
      "management": "Use Oxymetazoline cautiously and sparingly. Monitor blood pressure, especially in patients with pre-existing hypertension.",
      "evidenceLevel": "Minor"
    },
    {
      "id": "16",
      "activeIngredientA": "SIMVASTATIN",
      "activeIngredientB": "AMLODIPINE",
      "severity": "Moderate",
      "description": "Increased risk of myopathy and rhabdomyolysis.",
      "mechanism": "Amlodipine (a weak to moderate CYP3A4 inhibitor) can increase Simvastatin plasma levels, as Simvastatin is a CYP3A4 substrate.",
      "management": "The Simvastatin dose should not exceed **20 mg daily** when co-administered with Amlodipine.",
      "evidenceLevel": "High"
    },
    {
      "id": "17",
      "activeIngredientA": "CIPROFLOXACIN",
      "activeIngredientB": "THEOPHYLLINE",
      "severity": "Moderate",
      "description": "Increased Theophylline toxicity (e.g., seizures, arrhythmias).",
      "mechanism": "Ciprofloxacin inhibits CYP1A2, the enzyme responsible for Theophylline metabolism, leading to elevated and potentially toxic Theophylline concentrations.",
      "management": "Avoid combination. If necessary, Theophylline dose must be significantly reduced and serum Theophylline concentration monitored closely.",
      "evidenceLevel": "High"
    },
    {
      "id": "18",
      "activeIngredientA": "METRONIDAZOLE",
      "activeIngredientB": "ALCOHOL",
      "severity": "Moderate",
      "description": "Risk of a disulfiram-like reaction (flushing, palpitations, nausea, vomiting, headache).",
      "mechanism": "Metronidazole inhibits acetaldehyde dehydrogenase, which prevents the breakdown of alcohol's primary metabolite, acetaldehyde, leading to its accumulation.",
      "management": "Patients must strictly **avoid alcohol or alcohol-containing products** during treatment and for at least 3 days after stopping Metronidazole.",
      "evidenceLevel": "High"
    },
    {
      "id": "19",
      "activeIngredientA": "CHLORPHENIRAMINE",
      "activeIngredientB": "DIAZEPAM",
      "severity": "Moderate",
      "description": "Increased sedation and central nervous system (CNS) depression.",
      "mechanism": "Additive CNS depressant effects, as Chlorpheniramine (an antihistamine) and Diazepam (a benzodiazepine) both cause sedation.",
      "management": "Advise patients about the increased risk of drowsiness and impairment. Avoid activities requiring mental alertness, such as driving.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "20",
      "activeIngredientA": "GLIPIZIDE",
      "activeIngredientB": "FLUCONAZOLE",
      "severity": "Moderate",
      "description": "Increased risk of hypoglycemia (low blood sugar).",
      "mechanism": "Fluconazole inhibits CYP2C9, the enzyme responsible for metabolizing Glipizide (a sulfonylurea), leading to elevated Glipizide levels and enhanced glucose-lowering effect.",
      "management": "Monitor blood glucose closely. Glipizide dose reduction may be required.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "21",
      "activeIngredientA": "DIGOXIN",
      "activeIngredientB": "FUROSEMIDE",
      "severity": "Moderate",
      "description": "Increased risk of Digoxin toxicity due to hypokalemia.",
      "mechanism": "Furosemide (a loop diuretic) causes potassium loss. Hypokalemia increases myocardial sensitivity to Digoxin, potentiating its toxic effects (arrhythmias, nausea).",
      "management": "Monitor potassium levels closely and maintain within normal range. May require potassium supplementation.",
      "evidenceLevel": "High"
    },
    {
      "id": "22",
      "activeIngredientA": "PHENYTOIN",
      "activeIngredientB": "CIMETIDINE",
      "severity": "Moderate",
      "description": "Increased Phenytoin levels and risk of toxicity (nystagmus, ataxia, drowsiness).",
      "mechanism": "Cimetidine inhibits cytochrome P450 enzymes (particularly CYP2C9 and CYP2C19), reducing Phenytoin metabolism.",
      "management": "Monitor Phenytoin levels. Consider alternative H2-receptor antagonist (e.g., Famotidine) which has less enzyme inhibition.",
      "evidenceLevel": "High"
    },
    {
      "id": "23",
      "activeIngredientA": "CARBAMAZEPINE",
      "activeIngredientB": "VERAPAMIL",
      "severity": "Moderate",
      "description": "Increased Carbamazepine levels and risk of neurotoxicity.",
      "mechanism": "Verapamil inhibits CYP3A4, the primary metabolic pathway for Carbamazepine, leading to its accumulation.",
      "management": "Monitor Carbamazepine levels and for signs of toxicity (dizziness, ataxia, drowsiness). Dose reduction of Carbamazepine may be necessary.",
      "evidenceLevel": "High"
    },
    {
      "id": "24",
      "activeIngredientA": "SPIRONOLACTONE",
      "activeIngredientB": "LISINOPRIL",
      "severity": "Moderate",
      "description": "Increased risk of hyperkalemia (high potassium levels).",
      "mechanism": "Both drugs can increase serum potassium; Spironolactone by antagonizing aldosterone, and Lisinopril by reducing angiotensin II-mediated aldosterone release.",
      "management": "Monitor potassium levels regularly, especially at initiation and with dose changes.",
      "evidenceLevel": "High"
    },
    {
      "id": "25",
      "activeIngredientA": "CODEINE",
      "activeIngredientB": "PAROXETINE",
      "severity": "Moderate",
      "description": "Reduced analgesic effect of Codeine.",
      "mechanism": "Codeine requires activation by CYP2D6 to morphine for its analgesic effect. Paroxetine, a potent CYP2D6 inhibitor, blocks this conversion.",
      "management": "Consider an alternative analgesic not metabolized by CYP2D6 (e.g., Morphine, Oxycodone).",
      "evidenceLevel": "High"
    },
    {
      "id": "26",
      "activeIngredientA": "ORLISTAT",
      "activeIngredientB": "LEVOTHYROXINE",
      "severity": "Moderate",
      "description": "Reduced absorption and efficacy of Levothyroxine.",
      "mechanism": "Orlistat can impair the absorption of fat-soluble vitamins and other lipophilic drugs, potentially including Levothyroxine.",
      "management": "Administer Levothyroxine at least 4 hours apart from Orlistat.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "27",
      "activeIngredientA": "SERTRALINE",
      "activeIngredientB": "TRAMADOL",
      "severity": "Moderate",
      "description": "Increased risk of Serotonin Syndrome.",
      "mechanism": "Additive serotonergic effects. Both drugs increase serotonin activity in the central nervous system.",
      "management": "Avoid combination if possible. If used together, monitor for symptoms of Serotonin Syndrome.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "28",
      "activeIngredientA": "COLCHICINE",
      "activeIngredientB": "CLARITHROMYCIN",
      "severity": "Severe",
      "description": "Increased risk of colchicine toxicity (myelosuppression, multiorgan failure).",
      "mechanism": "Clarithromycin (a P-glycoprotein and CYP3A4 inhibitor) decreases the metabolism and transport of Colchicine, leading to dangerously high levels.",
      "management": "Contraindicated in patients with renal or hepatic impairment. In others, dose adjustment and close monitoring are critical.",
      "evidenceLevel": "High"
    },
    {
      "id": "29",
      "activeIngredientA": "QUETIAPINE",
      "activeIngredientB": "KETOCONAZOLE",
      "severity": "Moderate",
      "description": "Increased Quetiapine levels and risk of adverse effects (sedation, hypotension).",
      "mechanism": "Ketoconazole is a potent CYP3A4 inhibitor. Quetiapine is extensively metabolized by CYP3A4.",
      "management": "The Quetiapine dose should be reduced to one-sixth of the original dose if co-administered with a strong CYP3A4 inhibitor.",
      "evidenceLevel": "High"
    },
    {
      "id": "30",
      "activeIngredientA": "DULOXETINE",
      "activeIngredientB": "IBUPROFEN",
      "severity": "Moderate",
      "description": "Increased risk of bleeding.",
      "mechanism": "Duloxetine can inhibit serotonin uptake by platelets, impairing platelet function. Ibuprofen inhibits platelet aggregation via COX-1. Effects are additive.",
      "management": "Monitor for signs of bleeding. Consider gastrointestinal protection (e.g., PPI) if chronic use is necessary.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "31",
      "activeIngredientA": "LITHIUM",
      "activeIngredientB": "HYDROCHLOROTHIAZIDE",
      "severity": "Severe",
      "description": "Increased risk of lithium toxicity (tremor, confusion, seizures).",
      "mechanism": "Thiazide diuretics reduce renal clearance of lithium by promoting sodium loss and triggering compensatory lithium reabsorption in the proximal tubule.",
      "management": "Avoid combination if possible. If necessary, reduce lithium dose by 25-50% and monitor lithium levels weekly initially.",
      "evidenceLevel": "High"
    },
    {
      "id": "32",
      "activeIngredientA": "LINEZOLID",
      "activeIngredientB": "SERTRALINE",
      "severity": "Severe",
      "description": "Increased risk of serotonin syndrome.",
      "mechanism": "Linezolid is a weak, reversible monoamine oxidase inhibitor (MAOI). Combined with SSRIs like sertraline, this can lead to excessive serotonin accumulation.",
      "management": "Generally avoid combination. If essential, discontinue sertraline at least 2 weeks before starting linezolid and monitor closely.",
      "evidenceLevel": "High"
    },
    {
      "id": "33",
      "activeIngredientA": "CLOPIDOGREL",
      "activeIngredientB": "OMEPRAZOLE",
      "severity": "Moderate",
      "description": "Reduced antiplatelet effect of clopidogrel, increasing cardiovascular risk.",
      "mechanism": "Omeprazole inhibits CYP2C19, the enzyme required to convert clopidogrel to its active metabolite.",
      "management": "Use alternative PPI with less CYP2C19 inhibition (pantoprazole, dexlansoprazole) or H2-receptor antagonists.",
      "evidenceLevel": "High"
    },
    {
      "id": "34",
      "activeIngredientA": "METHADONE",
      "activeIngredientB": "CARBAMAZEPINE",
      "severity": "Moderate",
      "description": "Reduced methadone levels and potential withdrawal symptoms.",
      "mechanism": "Carbamazepine induces CYP3A4, increasing methadone metabolism and reducing its plasma concentrations.",
      "management": "Monitor for opioid withdrawal. Methadone dose increase of 20-100% may be required during concomitant therapy.",
      "evidenceLevel": "High"
    },
    {
      "id": "35",
      "activeIngredientA": "TACROLIMUS",
      "activeIngredientB": "FLUCONAZOLE",
      "severity": "Severe",
      "description": "Increased tacrolimus levels and risk of nephrotoxicity, neurotoxicity.",
      "mechanism": "Fluconazole inhibits CYP3A4, the primary enzyme responsible for tacrolimus metabolism.",
      "management": "Reduce tacrolimus dose by 50-75% and monitor levels frequently (2-3 times weekly initially).",
      "evidenceLevel": "High"
    },
    {
      "id": "36",
      "activeIngredientA": "LEVODOPA",
      "activeIngredientB": "METOCLOPRAMIDE",
      "severity": "Moderate",
      "description": "Reduced effectiveness of levodopa for Parkinson's disease.",
      "mechanism": "Metoclopramide is a dopamine antagonist and can counteract the effects of levodopa (dopamine precursor).",
      "management": "Avoid metoclopramide in Parkinson's patients. Use alternative antiemetics like domperidone if needed.",
      "evidenceLevel": "High"
    },
    {
      "id": "37",
      "activeIngredientA": "VALPROIC ACID",
      "activeIngredientB": "CARBAPENEMS",
      "severity": "Severe",
      "description": "Dramatic reduction in valproic acid levels, risking seizure breakthrough.",
      "mechanism": "Carbapenems increase the renal clearance and possibly non-renal elimination of valproic acid.",
      "management": "Avoid combination. If unavoidable, monitor valproic acid levels daily and increase dose as needed. Consider alternative antiepileptic.",
      "evidenceLevel": "High"
    },
    {
      "id": "38",
      "activeIngredientA": "QUINIDINE",
      "activeIngredientB": "DIGOXIN",
      "severity": "Moderate",
      "description": "Increased digoxin levels and risk of toxicity.",
      "mechanism": "Quinidine reduces renal and non-renal clearance of digoxin and displaces it from tissue binding sites.",
      "management": "Reduce digoxin dose by 30-50% when starting quinidine and monitor digoxin levels.",
      "evidenceLevel": "High"
    },
    {
      "id": "39",
      "activeIngredientA": "THEOPHYLLINE",
      "activeIngredientB": "CIMETIDINE",
      "severity": "Moderate",
      "description": "Increased theophylline levels and risk of toxicity.",
      "mechanism": "Cimetidine inhibits CYP1A2, reducing theophylline metabolism.",
      "management": "Monitor theophylline levels. Consider alternative H2-blocker (famotidine) or reduce theophylline dose by 30%.",
      "evidenceLevel": "High"
    },
    {
      "id": "40",
      "activeIngredientA": "RISPERIDONE",
      "activeIngredientB": "PAROXETINE",
      "severity": "Moderate",
      "description": "Increased risperidone levels and risk of extrapyramidal symptoms.",
      "mechanism": "Paroxetine inhibits CYP2D6, which metabolizes risperidone to its active metabolite.",
      "management": "Reduce risperidone dose by 50% or consider alternative antipsychotic or antidepressant.",
      "evidenceLevel": "High"
    },
    {
      "id": "41",
      "activeIngredientA": "WARFARIN",
      "activeIngredientB": "PHENYTOIN",
      "severity": "Variable",
      "description": "Complex interaction - may increase or decrease warfarin effect.",
      "mechanism": "Phenytoin can induce warfarin metabolism (decreasing effect) but also competes for protein binding (increasing free fraction).",
      "management": "Monitor INR closely when starting, adjusting, or stopping phenytoin. Warfarin dose adjustments are often needed.",
      "evidenceLevel": "High"
    },
    {
      "id": "42",
      "activeIngredientA": "CYCLOSPORINE",
      "activeIngredientB": "ST. JOHN'S WORT",
      "severity": "Severe",
      "description": "Reduced cyclosporine levels, risking organ rejection.",
      "mechanism": "St. John's Wort induces CYP3A4 and P-glycoprotein, increasing cyclosporine metabolism and reducing bioavailability.",
      "management": "Avoid combination. If used, monitor cyclosporine levels frequently and expect dose increases of 2-3 fold.",
      "evidenceLevel": "High"
    },
    {
      "id": "43",
      "activeIngredientA": "METFORMIN",
      "activeIngredientB": "IODINATED CONTRAST",
      "severity": "Moderate",
      "description": "Increased risk of lactic acidosis and contrast-induced nephropathy.",
      "mechanism": "Iodinated contrast can impair renal function, reducing metformin elimination.",
      "management": "Withhold metformin before contrast procedure and restart only after 48 hours when renal function is confirmed normal.",
      "evidenceLevel": "High"
    },
    {
      "id": "44",
      "activeIngredientA": "DILTIAZEM",
      "activeIngredientB": "SIMVASTATIN",
      "severity": "Moderate",
      "description": "Increased simvastatin levels and risk of myopathy.",
      "mechanism": "Diltiazem inhibits CYP3A4, reducing simvastatin metabolism.",
      "management": "Limit simvastatin dose to 10 mg daily when used with diltiazem.",
      "evidenceLevel": "High"
    },
    {
      "id": "45",
      "activeIngredientA": "LEVOFLOXACIN",
      "activeIngredientB": "MULTIVITAMINS",
      "severity": "Moderate",
      "description": "Reduced absorption of levofloxacin.",
      "mechanism": "Divalent cations (calcium, iron, zinc, magnesium) in multivitamins chelate with fluoroquinolones in GI tract.",
      "management": "Administer levofloxacin at least 2 hours before or 6 hours after multivitamins containing minerals.",
      "evidenceLevel": "High"
    },
    {
      "id": "46",
      "activeIngredientA": "PROPRANOLOL",
      "activeIngredientB": "ALBUTEROL",
      "severity": "Moderate",
      "description": "Mutual antagonism - reduced bronchodilation and reduced beta-blockade.",
      "mechanism": "Propranolol (non-selective beta-blocker) blocks beta-2 receptors needed for albuterol's bronchodilator effect.",
      "management": "Avoid non-selective beta-blockers in asthma/COPD patients. Use cardioselective beta-blockers (metoprolol) if essential.",
      "evidenceLevel": "High"
    },
    {
      "id": "47",
      "activeIngredientA": "ORAL CONTRACEPTIVES",
      "activeIngredientB": "ANTACIDS",
      "severity": "Minor",
      "description": "Potential reduced contraceptive effectiveness.",
      "mechanism": "Antacids may increase gastric pH and potentially alter dissolution or absorption of contraceptive components.",
      "management": "Separate administration by 2-3 hours. Consider backup contraception during antacid therapy.",
      "evidenceLevel": "Moderate"
    },
    {
      "id": "48",
      "activeIngredientA": "VORICONAZOLE",
      "activeIngredientB": "PHENOBARBITAL",
      "severity": "Severe",
      "description": "Reduced voriconazole levels, risking treatment failure.",
      "mechanism": "Phenobarbital strongly induces CYP2C19 and CYP3A4, increasing voriconazole metabolism.",
      "management": "Avoid combination. Use alternative antifungal not metabolized by CYP450 system.",
      "evidenceLevel": "High"
    },
    {
      "id": "49",
      "activeIngredientA": "DOFETILIDE",
      "activeIngredientB": "HYDROCHLOROTHIAZIDE",
      "severity": "Severe",
      "description": "Increased risk of life-threatening arrhythmias (torsades de pointes).",
      "mechanism": "Thiazide-induced hypokalemia and hypomagnesemia increase myocardial sensitivity to dofetilide's QT-prolonging effects.",
      "management": "Contraindicated combination. Use alternative antihypertensive.",
      "evidenceLevel": "High"
    },
    {
      "id": "50",
      "activeIngredientA": "BUPROPION",
      "activeIngredientB": "TAMOXIFEN",
      "severity": "Moderate",
      "description": "Reduced efficacy of tamoxifen.",
      "mechanism": "Bupropion inhibits CYP2D6, which converts tamoxifen to its active metabolite endoxifen.",
      "management": "Avoid combination. Use alternative antidepressant with minimal CYP2D6 inhibition (sertraline, citalopram).",
      "evidenceLevel": "High"
    },
    {
      "id": "51",
      "activeIngredientA": "GEMFIBROZIL",
      "activeIngredientB": "REPAGLINIDE",
      "severity": "Severe",
      "description": "Increased repaglinide levels and prolonged hypoglycemia.",
      "mechanism": "Gemfibrozil inhibits CYP2C8 and OATP1B1 transport, reducing repaglinide metabolism and clearance.",
      "management": "Avoid combination. If used, reduce repaglinide dose and monitor glucose frequently.",
      "evidenceLevel": "High"
    },
    {
      "id": "52",
      "activeIngredientA": "ISOTRETINOIN",
      "activeIngredientB": "TETRACYCLINE",
      "severity": "Severe",
      "description": "Increased risk of pseudotumor cerebri (benign intracranial hypertension).",
      "mechanism": "Both drugs independently can cause this rare adverse effect; risk is synergistic.",
      "management": "Avoid combination. Use alternative antibiotic if needed during isotretinoin therapy.",
      "evidenceLevel": "High"
    },
    {
      "id": "53",
      "activeIngredientA": "POTASSIUM SUPPLEMENTS",
      "activeIngredientB": "LISINOPRIL",
      "severity": "Moderate",
      "description": "Increased risk of hyperkalemia.",
      "mechanism": "ACE inhibitors reduce aldosterone-mediated potassium excretion, potentiating effects of potassium supplements.",
      "management": "Monitor potassium levels regularly. Avoid salt substitutes containing potassium.",
      "evidenceLevel": "High"
    },
    {
      "id": "54",
      "activeIngredientA": "DULOXETINE",
      "activeIngredientB": "TRAMADOL",
      "severity": "Moderate",
      "description": "Increased risk of serotonin syndrome and seizures.",
      "mechanism": "Both increase serotonin activity; duloxetine also inhibits CYP2D6 metabolism of tramadol.",
      "management": "Avoid combination. If necessary, use lowest doses and monitor for serotonin syndrome symptoms.",
      "evidenceLevel": "High"
    },
    {
      "id": "55",
      "activeIngredientA": "VERAPAMIL",
      "activeIngredientB": "BETA-BLOCKERS",
      "severity": "Moderate",
      "description": "Additive negative chronotropic and inotropic effects.",
      "mechanism": "Both classes depress sinus node function and AV conduction, and reduce myocardial contractility.",
      "management": "Use with caution. Monitor for bradycardia, heart block, and heart failure. Avoid in patients with conduction abnormalities.",
      "evidenceLevel": "High"
    },
    {
      "id": "56",
      "activeIngredientA": "PHENYTOIN",
      "activeIngredientB": "TOLBUTAMIDE",
      "severity": "Moderate",
      "description": "Reduced tolbutamide efficacy and potential loss of glycemic control.",
      "mechanism": "Phenytoin induces CYP2C9, increasing metabolism of tolbutamide.",
      "management": "Monitor blood glucose closely. Tolbutamide dose increase may be necessary.",
      "evidenceLevel": "High"
    },
    {
      "id": "57",
      "activeIngredientA": "CIPROFLOXACIN",
      "activeIngredientB": "TIZANIDINE",
      "severity": "Severe",
      "description": "Dramatically increased tizanidine levels causing severe hypotension and sedation.",
      "mechanism": "Ciprofloxacin inhibits CYP1A2, the primary enzyme metabolizing tizanidine.",
      "management": "Contraindicated combination. Use alternative antibiotic.",
      "evidenceLevel": "High"
    },
    {
      "id": "58",
      "activeIngredientA": "METHOTREXATE",
      "activeIngredientB": "PROBENECID",
      "severity": "Moderate",
      "description": "Increased methotrexate levels and toxicity risk.",
      "mechanism": "Probenecid inhibits renal tubular secretion of methotrexate, reducing its clearance.",
      "management": "Avoid combination. If used, monitor methotrexate levels closely and reduce dose accordingly.",
      "evidenceLevel": "High"
    },
    {
      "id": "59",
      "activeIngredientA": "DIGOXIN",
      "activeIngredientB": "ITRACONAZOLE",
      "severity": "Moderate",
      "description": "Increased digoxin levels and toxicity risk.",
      "mechanism": "Itraconazole inhibits P-glycoprotein, reducing digoxin biliary and renal secretion.",
      "management": "Monitor digoxin levels. Reduce dose by 25-50% when starting itraconazole.",
      "evidenceLevel": "High"
    },
    {
      "id": "60",
      "activeIngredientA": "WARFARIN",
      "activeIngredientB": "ACETAMINOPHEN",
      "severity": "Moderate",
      "description": "Increased anticoagulant effect and bleeding risk.",
      "mechanism": "High doses of acetaminophen may inhibit warfarin metabolism via unclear mechanisms.",
      "management": "Monitor INR if acetaminophen >2g/day used chronically. Avoid regular high-dose use.",
      "evidenceLevel": "Moderate"
    }
  ]